Revit 2027 API
BuiltInFailures.SplitSketchBasedElementFailures.NotSplitValidRegions Property
 The split failed. There may be a gap in the boundary loop or the sketch may be incomplete.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotSplitValidRegions { get; }
Public Shared ReadOnly Property NotSplitValidRegions As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotSplitValidRegions {
	FailureDefinitionId^ get ();
}
static member NotSplitValidRegions : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SplitSketchBasedElementFailures Class
Autodesk.Revit.DB Namespace